Project/Toir/src/DataProcessors/торо_МобильныеПриложения/торо_МобильныеПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_МобильныеПриложения</name>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/торо_МобильныеПриложения/торо_МобильныеПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МобильныеПриложения</name>
  <resources>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.mobile</types>
      <types>ExchangePlanRef.mobileBrigades</types>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МобильноеПриложение</name>
    <type>
      <types>EnumRef.торо_МобильноеПриложение</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/DataProcessors/торо_МобильныеПриложения/Forms/ФормаПодразделений/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицу();
	
	ОбновляемоеРасстояниеПоУмолчнию = Константы.торо_ОбновляемоеРасстояниеПоУмолчанию.Получить();
	Если ОбновляемоеРасстояниеПоУмолчнию = 0 Тогда
		ОбновляемоеРасстояниеПоУмолчнию = 125;
		ОбновитьРасстояниеПоУмолчанию(ОбновляемоеРасстояниеПоУмолчнию);
	КонецЕсли;
	
	ПогрешностьГеоконтроляПоУмолчанию = Константы.торо_ПогрешностьГеоконтроляПоУмолчанию.Получить();
	Если ПогрешностьГеоконтроляПоУмолчанию = 0 Тогда
		ПогрешностьГеоконтроляПоУмолчанию = 15;
		ОбновитьПогрешностьГеоконтроляПоУмолчанию(ПогрешностьГеоконтроляПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТаблицу();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбновляемоеРасстояниеПоУмолчниюПриИзменении(Элемент)
	
	Если ОбновляемоеРасстояниеПоУмолчнию = 0 Тогда
		ОбновляемоеРасстояниеПоУмолчнию = 125;
	КонецЕсли;
	
	ОбновитьРасстояниеПоУмолчанию(ОбновляемоеРасстояниеПоУмолчнию);
	
КонецПроцедуры


&НаКлиенте
Процедура ПогрешностьГеоконтроляПоУмолчаниюПриИзменении(Элемент)
	
	Если ПогрешностьГеоконтроляПоУмолчанию = 0 Тогда
		ПогрешностьГеоконтроляПоУмолчанию = 15;
	КонецЕсли;
	
	ОбновитьПогрешностьГеоконтроляПоУмолчанию(ПогрешностьГеоконтроляПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура УзлыПодразделениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Узлы.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ИзменитьРеквизитУзла(ТекДанные.Узел, "Подразделение", ТекДанные.Подразделение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УзлыОбновляемоеРасстояниеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Узлы.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ИзменитьРеквизитУзла(ТекДанные.Узел, "ОбновляемоеРасстояние", ТекДанные.ОбновляемоеРасстояние);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УзлыБригадаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Узлы.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ИзменитьРеквизитУзла(ТекДанные.Узел, "Бригада", ТекДанные.Бригада);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УзлыГеоконтрольПриИзменении(Элемент)
	
	ТекДанные = Элементы.Узлы.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ИзменитьРеквизитУзла(ТекДанные.Узел, "Геоконтроль", ТекДанные.Геоконтроль);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УзлыПогрешностьПриИзменении(Элемент)
	
	ТекДанные = Элементы.Узлы.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ИзменитьРеквизитУзла(ТекДанные.Узел, "ПогрешностьГеоконтроля", ТекДанные.Погрешность);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицу()
	
	Узлы.Очистить();
	
	ЭтотУзел = ПланыОбмена.mobileBrigades.ЭтотУзел();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	mobileBrigades.Ссылка КАК Узел,
	               |	торо_МобильныеПриложения.Наименование КАК Наименование,
	               |	mobileBrigades.ИмяУстройства КАК ИмяУстройства,
	               |	mobileBrigades.ДатаПоследнегоСоединения КАК ДатаПоследнегоСоединения,
	               |	mobileBrigades.ПоследнийПользователь КАК ПоследнийПользователь,
	               |	mobileBrigades.Подразделение КАК Подразделение,
	               |	mobileBrigades.ОбновляемоеРасстояние КАК ОбновляемоеРасстояние,
	               |	mobileBrigades.Бригада КАК Бригада,
				   |	mobileBrigades.Геоконтроль КАК Геоконтроль, 
				   |	mobileBrigades.ПогрешностьГеоконтроля КАК Погрешность
	               |ИЗ
	               |	ПланОбмена.mobileBrigades КАК mobileBrigades
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МобильныеПриложения КАК торо_МобильныеПриложения
	               |		ПО mobileBrigades.Ссылка = торо_МобильныеПриложения.Узел
	               |ГДЕ
	               |	mobileBrigades.Ссылка <> &ЭтотУзел";
	
	Запрос.УстановитьПараметр("ЭтотУзел", ЭтотУзел);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = Узлы.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьРасстояниеПоУмолчанию(Расстояние)
	Константы.торо_ОбновляемоеРасстояниеПоУмолчанию.Установить(Расстояние);
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ОбновитьПогрешностьГеоконтроляПоУмолчанию(Погрешность)
	Константы.торо_ПогрешностьГеоконтроляПоУмолчанию.Установить(Погрешность);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьРеквизитУзла(Узел, ИмяРеквизита, Значение)
	
	Объект = Узел.ПолучитьОбъект();
	Объект[ИмяРеквизита] = Значение;
	Объект.Записать();
	
КонецПроцедуры
#КонецОбласти
